{
    "architectures": [
      "AnyModel"
    ],
    "base_architectures": [
      "LlamaForCausalLM"
    ],
    "attention_bias": false,
    "attention_dropout": 0.0,
    "block_configs": [
      {
        "attention": {
          "llama4": null,
          "mamba": null,
          "no_op": false,
          "num_key_value_heads": 8,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "ffn": {
          "intermediate_size": 14336,
          "moe": null,
          "no_op": false,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "parallel_blocks": null
      },
      {
        "attention": {
          "llama4": null,
          "mamba": null,
          "no_op": false,
          "num_key_value_heads": 8,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "ffn": {
          "intermediate_size": 14336,
          "moe": null,
          "no_op": false,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "parallel_blocks": null
      },
      {
        "attention": {
          "llama4": null,
          "mamba": null,
          "no_op": false,
          "num_key_value_heads": 8,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "ffn": {
          "intermediate_size": 14336,
          "moe": null,
          "no_op": false,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "parallel_blocks": null
      },
      {
        "attention": {
          "llama4": null,
          "mamba": null,
          "no_op": false,
          "num_key_value_heads": 8,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "ffn": {
          "intermediate_size": 11520,
          "moe": null,
          "no_op": false,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "parallel_blocks": null
      },
      {
        "attention": {
          "llama4": null,
          "mamba": null,
          "no_op": false,
          "num_key_value_heads": 8,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "ffn": {
          "intermediate_size": 14336,
          "moe": null,
          "no_op": false,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "parallel_blocks": null
      },
      {
        "attention": {
          "llama4": null,
          "mamba": null,
          "no_op": false,
          "num_key_value_heads": 8,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "ffn": {
          "intermediate_size": 14336,
          "moe": null,
          "no_op": false,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "parallel_blocks": null
      },
      {
        "attention": {
          "llama4": null,
          "mamba": null,
          "no_op": false,
          "num_key_value_heads": 8,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "ffn": {
          "intermediate_size": 14336,
          "moe": null,
          "no_op": false,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "parallel_blocks": null
      },
      {
        "attention": {
          "llama4": null,
          "mamba": null,
          "no_op": false,
          "num_key_value_heads": 8,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "ffn": {
          "intermediate_size": 14336,
          "moe": null,
          "no_op": false,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "parallel_blocks": null
      },
      {
        "attention": {
          "llama4": null,
          "mamba": null,
          "no_op": false,
          "num_key_value_heads": 8,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "ffn": {
          "intermediate_size": 14336,
          "moe": null,
          "no_op": false,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "parallel_blocks": null
      },
      {
        "attention": {
          "llama4": null,
          "mamba": null,
          "no_op": false,
          "num_key_value_heads": 8,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "ffn": {
          "intermediate_size": 14336,
          "moe": null,
          "no_op": false,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "parallel_blocks": null
      },
      {
        "attention": {
          "llama4": null,
          "mamba": null,
          "no_op": false,
          "num_key_value_heads": 8,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "ffn": {
          "intermediate_size": 14336,
          "moe": null,
          "no_op": false,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "parallel_blocks": null
      },
      {
        "attention": {
          "llama4": null,
          "mamba": null,
          "no_op": false,
          "num_key_value_heads": 8,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "ffn": {
          "intermediate_size": 11520,
          "moe": null,
          "no_op": false,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "parallel_blocks": null
      },
      {
        "attention": {
          "llama4": null,
          "mamba": null,
          "no_op": false,
          "num_key_value_heads": 8,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "ffn": {
          "intermediate_size": 14336,
          "moe": null,
          "no_op": false,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "parallel_blocks": null
      },
      {
        "attention": {
          "llama4": null,
          "mamba": null,
          "no_op": false,
          "num_key_value_heads": 8,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "ffn": {
          "intermediate_size": 11520,
          "moe": null,
          "no_op": false,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "parallel_blocks": null
      },
      {
        "attention": {
          "llama4": null,
          "mamba": null,
          "no_op": false,
          "num_key_value_heads": 8,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "ffn": {
          "intermediate_size": 14336,
          "moe": null,
          "no_op": false,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "parallel_blocks": null
      },
      {
        "attention": {
          "llama4": null,
          "mamba": null,
          "no_op": false,
          "num_key_value_heads": 8,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "ffn": {
          "intermediate_size": 14336,
          "moe": null,
          "no_op": false,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "parallel_blocks": null
      },
      {
        "attention": {
          "llama4": null,
          "mamba": null,
          "no_op": false,
          "num_key_value_heads": 8,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "ffn": {
          "intermediate_size": 14336,
          "moe": null,
          "no_op": false,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "parallel_blocks": null
      },
      {
        "attention": {
          "llama4": null,
          "mamba": null,
          "no_op": false,
          "num_key_value_heads": 8,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "ffn": {
          "intermediate_size": 14336,
          "moe": null,
          "no_op": false,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "parallel_blocks": null
      },
      {
        "attention": {
          "llama4": null,
          "mamba": null,
          "no_op": true,
          "num_key_value_heads": null,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "ffn": {
          "intermediate_size": 11520,
          "moe": null,
          "no_op": false,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "parallel_blocks": null
      },
      {
        "attention": {
          "llama4": null,
          "mamba": null,
          "no_op": true,
          "num_key_value_heads": null,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "ffn": {
          "intermediate_size": 11520,
          "moe": null,
          "no_op": false,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "parallel_blocks": null
      },
      {
        "attention": {
          "llama4": null,
          "mamba": null,
          "no_op": true,
          "num_key_value_heads": null,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "ffn": {
          "intermediate_size": 11520,
          "moe": null,
          "no_op": false,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "parallel_blocks": null
      },
      {
        "attention": {
          "llama4": null,
          "mamba": null,
          "no_op": true,
          "num_key_value_heads": null,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "ffn": {
          "intermediate_size": 11520,
          "moe": null,
          "no_op": false,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "parallel_blocks": null
      },
      {
        "attention": {
          "llama4": null,
          "mamba": null,
          "no_op": true,
          "num_key_value_heads": null,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "ffn": {
          "intermediate_size": 11520,
          "moe": null,
          "no_op": false,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "parallel_blocks": null
      },
      {
        "attention": {
          "llama4": null,
          "mamba": null,
          "no_op": true,
          "num_key_value_heads": null,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "ffn": {
          "intermediate_size": 11520,
          "moe": null,
          "no_op": false,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "parallel_blocks": null
      },
      {
        "attention": {
          "llama4": null,
          "mamba": null,
          "no_op": true,
          "num_key_value_heads": null,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "ffn": {
          "intermediate_size": 8704,
          "moe": null,
          "no_op": false,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "parallel_blocks": null
      },
      {
        "attention": {
          "llama4": null,
          "mamba": null,
          "no_op": true,
          "num_key_value_heads": null,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "ffn": {
          "intermediate_size": 11520,
          "moe": null,
          "no_op": false,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "parallel_blocks": null
      },
      {
        "attention": {
          "llama4": null,
          "mamba": null,
          "no_op": true,
          "num_key_value_heads": null,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "ffn": {
          "intermediate_size": 8704,
          "moe": null,
          "no_op": false,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "parallel_blocks": null
      },
      {
        "attention": {
          "llama4": null,
          "mamba": null,
          "no_op": true,
          "num_key_value_heads": null,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "ffn": {
          "intermediate_size": 8704,
          "moe": null,
          "no_op": false,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "parallel_blocks": null
      },
      {
        "attention": {
          "llama4": null,
          "mamba": null,
          "no_op": true,
          "num_key_value_heads": null,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "ffn": {
          "intermediate_size": 14336,
          "moe": null,
          "no_op": false,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "parallel_blocks": null
      },
      {
        "attention": {
          "llama4": null,
          "mamba": null,
          "no_op": false,
          "num_key_value_heads": 8,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "ffn": {
          "intermediate_size": 14336,
          "moe": null,
          "no_op": false,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "parallel_blocks": null
      },
      {
        "attention": {
          "llama4": null,
          "mamba": null,
          "no_op": false,
          "num_key_value_heads": 8,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "ffn": {
          "intermediate_size": 14336,
          "moe": null,
          "no_op": false,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "parallel_blocks": null
      },
      {
        "attention": {
          "llama4": null,
          "mamba": null,
          "no_op": false,
          "num_key_value_heads": 8,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "ffn": {
          "intermediate_size": 11520,
          "moe": null,
          "no_op": false,
          "replace_with_linear": false,
          "sparsify": null,
          "weights_precision": "bf16"
        },
        "parallel_blocks": null
      }
    ],
    "bos_token_id": 128000,
    "dtype": "bfloat16",
    "eos_token_id": [
      128001,
      128008,
      128009
    ],
    "head_dim": 128,
    "hidden_act": "silu",
    "hidden_size": 4096,
    "initializer_range": 0.02,
    "intermediate_size": 14336,
    "max_position_embeddings": 131072,
    "mlp_bias": false,
    "model_type": "llama",
    "num_attention_heads": 32,
    "num_hidden_layers": 32,
    "num_key_value_heads": 8,
    "pretraining_tp": 1,
    "rms_norm_eps": 1e-05,
    "rope_scaling": {
      "factor": 8.0,
      "high_freq_factor": 4.0,
      "low_freq_factor": 1.0,
      "original_max_position_embeddings": 8192,
      "rope_type": "llama3"
    },
    "rope_theta": 500000.0,
    "tie_word_embeddings": false,
    "transformers_version": "4.57.6",
    "use_cache": false,
    "vocab_size": 128256
  }
  