{
  "architectures": [
    "AnyModel"
  ],
  "base_architecture": "LlamaForCausalLM",
  "attention_bias": false,
  "attention_dropout": 0.0,
  "per_layer_config": {
    "3": {
      "intermediate_size": 11520
    },
    "11": {
      "intermediate_size": 11520
    },
    "13": {
      "intermediate_size": 11520
    },
    "18": {
      "skip": [
        "attention"
      ],
      "intermediate_size": 11520
    },
    "19": {
      "skip": [
        "attention"
      ],
      "intermediate_size": 11520
    },
    "20": {
      "skip": [
        "attention"
      ],
      "intermediate_size": 11520
    },
    "21": {
      "skip": [
        "attention"
      ],
      "intermediate_size": 11520
    },
    "22": {
      "skip": [
        "attention"
      ],
      "intermediate_size": 11520
    },
    "23": {
      "skip": [
        "attention"
      ],
      "intermediate_size": 11520
    },
    "24": {
      "skip": [
        "attention"
      ],
      "intermediate_size": 8704
    },
    "25": {
      "skip": [
        "attention"
      ],
      "intermediate_size": 11520
    },
    "26": {
      "skip": [
        "attention"
      ],
      "intermediate_size": 8704
    },
    "27": {
      "skip": [
        "attention"
      ],
      "intermediate_size": 8704
    },
    "28": {
      "skip": [
        "attention"
      ]
    },
    "31": {
      "intermediate_size": 11520
    }
  },
  "bos_token_id": 128000,
  "dtype": "bfloat16",
  "eos_token_id": [
    128001,
    128008,
    128009
  ],
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_size": 4096,
  "initializer_range": 0.02,
  "intermediate_size": 14336,
  "max_position_embeddings": 131072,
  "mlp_bias": false,
  "model_type": "anymodel",
  "num_attention_heads": 32,
  "num_hidden_layers": 32,
  "num_key_value_heads": 8,
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-05,
  "rope_scaling": {
    "factor": 8.0,
    "high_freq_factor": 4.0,
    "low_freq_factor": 1.0,
    "original_max_position_embeddings": 8192,
    "rope_type": "llama3"
  },
  "rope_theta": 500000.0,
  "tie_word_embeddings": false,
  "transformers_version": "4.57.6",
  "use_cache": false,
  "vocab_size": 128256
}
