{
    "attn_pdrop": 0.0,
    "scale_attn_weights": true,
    "resid_pdrop": 0.0,
    "mup_embeddings_scale": 1.0,
    "n_inner": 19114,
    "n_embd": 7168,
    "layer_norm_epsilon": 1e-05,
    "n_positions": 8192,
    "activation_function": "swiglu",
    "n_head": 56,
    "n_layer": 48,
    "mup_output_alpha": 2.22,
    "mup_width_scale": 0.03571428571428571,
    "position_embedding_type": "alibi",
    "mup_scale_qk_dot_by_d": true,
    "tie_word_embeddings": true,
    "vocab_size": 84992,
    "embd_pdrop": 0.0,
    "model_type": "jais",
    "use_cache": true,
    "width_scale":0.07928571428571429,
    "embeddings_scale":14.6,
    "scale_qk_dot_by_d":false,
    "auto_map": {
        "AutoConfig": "configuration_jais.JAISConfig",
        "AutoModel": "modeling_jais.JAISModel",
        "AutoModelForCausalLM": "modeling_jais.JAISLMHeadModel",
        "AutoModelForQuestionAnswering": "modeling_jais.JAISForQuestionAnswering",
        "AutoModelForSequenceClassification": "modeling_jais.JAISForSequenceClassification",
        "AutoModelForTokenClassification": "modeling_jais.JAISForTokenClassification"
    },
    "eos_token_id": 0,
    "pad_token_id": 0,
    "bos_token_id": 0,
    "initializer_range": 0.02,
    "architectures": ["JAISLMHeadModel"]
}