{
  "architectures": ["Qwen3MoeForCausalLM"],
  "model_type": "qwen3_moe",
  "hidden_size": 64,
  "intermediate_size": 128,
  "moe_intermediate_size": 64,
  "num_hidden_layers": 2,
  "num_attention_heads": 4,
  "num_key_value_heads": 2,
  "head_dim": 16,
  "num_experts": 8,
  "num_experts_per_tok": 2,
  "norm_topk_prob": true,
  "decoder_sparse_step": 1,
  "mlp_only_layers": [],
  "vocab_size": 1024,
  "max_position_embeddings": 1024,
  "rms_norm_eps": 1e-6,
  "rope_theta": 10000.0,
  "sliding_window": null,
  "tie_word_embeddings": false,
  "torch_dtype": "float16",
  "hidden_act": "silu"
}
